burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_evic.c
    /* if register write is enabled, set trigger source to target peripheral */
    if(RESET == evic_register_lock_get(target_periph)) {
        EVIC_TARGET_REG(target_periph) &= ~EVIC_TARGET_PERIPH_MASK(target_periph);
        EVIC_TARGET_REG(target_periph) |= ((uint32_t)event_source << EVIC_TARGET_PERIPH_SHIFT(
                                               target_periph)) & EVIC_TARGET_PERIPH_MASK(target_periph);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      get the event source for target peripheral (API_ID(0x0002U))
    \param[in]  target_periph: target peripheral value
                only one parameter can be selected which is shown as below:
      \arg        EVENT_INTERCONNECT_SGIO0: single I/O 0
      \arg        EVENT_INTERCONNECT_SGIO1: single I/O 1
      \arg        EVENT_INTERCONNECT_SGIO2: single I/O 2
      \arg        EVENT_INTERCONNECT_SGIO3: single I/O 3
      \arg        EVENT_INTERCONNECT_INGRPE: input group E
      \arg        EVENT_INTERCONNECT_INGRPF: input group F
      \arg        EVENT_INTERCONNECT_OUTGRPE: output group E
      \arg        EVENT_INTERCONNECT_OUTGRPF: output group F
      \arg        EVENT_INTERCONNECT_DAC0_OUT0_COV: DAC0_OUT0 conversion
      \arg        EVENT_INTERCONNECT_DAC0_OUT1_COV: DAC0_OUT1 conversion
      \arg        EVENT_INTERCONNECT_ADC0_GRP_EXTRIG0: ADC0 group external trigger 0
      \arg        EVENT_INTERCONNECT_ADC0_GRP_EXTRIG1: ADC0 group external trigger 1
      \arg        EVENT_INTERCONNECT_ADC2_GRP_EXTRIG0: ADC2 group external trigger 0
      \arg        EVENT_INTERCONNECT_ADC2_GRP_EXTRIG1: ADC2 group external trigger 1
      \arg        EVENT_INTERCONNECT_RCU: clock switch to IRC32M
      \arg        EVENT_INTERCONNECT_TIMER0: TIMER0
      \arg        EVENT_INTERCONNECT_TIMER7: TIMER7
      \arg        EVENT_INTERCONNECT_CPTIMER0: CPTIMER0
      \arg        EVENT_INTERCONNECT_CPTIMERW: CPTIMERW
      \arg        EVENT_INTERCONNECT_TIMER1: TIMER1
      \arg        EVENT_INTERCONNECT_TIMER2: TIMER2
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN0: GPTIMER trigger input 0
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN1: GPTIMER trigger input 1
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN2: GPTIMER trigger input 2
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN3: GPTIMER trigger input 3
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN4: GPTIMER trigger input 4
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN5: GPTIMER trigger input 5
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN6: GPTIMER trigger input 6
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN7: GPTIMER trigger input 7
      \arg        EVENT_INTERCONNECT_DAC0_OUT0_EN: DAC0_OUT0 enable
      \arg        EVENT_INTERCONNECT_DAC0_OUT1_EN: DAC0_OUT1 enable
      \arg        EVENT_INTERCONNECT_DMAMUX_0: DMAMUX multiplexer input 0
      \arg        EVENT_INTERCONNECT_DMAMUX_1: DMAMUX multiplexer input 1
      \arg        EVENT_INTERCONNECT_DMAMUX_2: DMAMUX multiplexer input 2
      \arg        EVENT_INTERCONNECT_DMAMUX_3: DMAMUX multiplexer input 3
      \arg        EVENT_INTERCONNECT_DMAMUX_4: DMAMUX multiplexer input 4
      \arg        EVENT_INTERCONNECT_DMAMUX_5: DMAMUX multiplexer input 5
      \arg        EVENT_INTERCONNECT_DMAMUX_6: DMAMUX multiplexer input 6
      \arg        EVENT_INTERCONNECT_DMAMUX_7: DMAMUX multiplexer input 7
      \arg        EVENT_INTERCONNECT_DMAMUX_8: DMAMUX multiplexer input 8
      \arg        EVENT_INTERCONNECT_DMAMUX_9: DMAMUX multiplexer input 9
      \arg        EVENT_INTERCONNECT_DMAMUX_10: DMAMUX multiplexer input 10
      \arg        EVENT_INTERCONNECT_DMAMUX_11: DMAMUX multiplexer input 11
    \param[out] none
    \retval  event_source: event source value
*/
event_source_enum evic_event_source_get(evic_periph_enum target_periph)
{
    event_source_enum event_source = EVIC_SOURCE_DISABLED;

    event_source = (event_source_enum)((EVIC_TARGET_REG(target_periph) & EVIC_TARGET_PERIPH_MASK(
                                            target_periph)) >> EVIC_TARGET_PERIPH_SHIFT(target_periph));

    return event_source;
}

/*!
    \brief      lock the event interconnect register (API_ID(0x0003U))
    \param[in]  target_periph: target peripheral value
                only one parameter can be selected which is shown as below:
      \arg        EVENT_INTERCONNECT_SGIO0: single I/O 0
      \arg        EVENT_INTERCONNECT_SGIO1: single I/O 1
      \arg        EVENT_INTERCONNECT_SGIO2: single I/O 2
      \arg        EVENT_INTERCONNECT_SGIO3: single I/O 3
      \arg        EVENT_INTERCONNECT_INGRPE: input group E
      \arg        EVENT_INTERCONNECT_INGRPF: input group F
      \arg        EVENT_INTERCONNECT_OUTGRPE: output group E
      \arg        EVENT_INTERCONNECT_OUTGRPF: output group F
      \arg        EVENT_INTERCONNECT_DAC0_OUT0_COV: DAC0_OUT0 conversion
      \arg        EVENT_INTERCONNECT_DAC0_OUT1_COV: DAC0_OUT1 conversion
      \arg        EVENT_INTERCONNECT_ADC0_GRP_EXTRIG0: ADC0 group external trigger 0
      \arg        EVENT_INTERCONNECT_ADC0_GRP_EXTRIG1: ADC0 group external trigger 1
      \arg        EVENT_INTERCONNECT_ADC2_GRP_EXTRIG0: ADC2 group external trigger 0
      \arg        EVENT_INTERCONNECT_ADC2_GRP_EXTRIG1: ADC2 group external trigger 1
      \arg        EVENT_INTERCONNECT_RCU: clock switch to IRC32M
      \arg        EVENT_INTERCONNECT_TIMER0: TIMER0
      \arg        EVENT_INTERCONNECT_TIMER7: TIMER7
      \arg        EVENT_INTERCONNECT_CPTIMER0: CPTIMER0
      \arg        EVENT_INTERCONNECT_CPTIMERW: CPTIMERW
      \arg        EVENT_INTERCONNECT_TIMER1: TIMER1
      \arg        EVENT_INTERCONNECT_TIMER2: TIMER2
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN0: GPTIMER trigger input 0
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN1: GPTIMER trigger input 1
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN2: GPTIMER trigger input 2
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN3: GPTIMER trigger input 3
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN4: GPTIMER trigger input 4
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN5: GPTIMER trigger input 5
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN6: GPTIMER trigger input 6
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN7: GPTIMER trigger input 7
      \arg        EVENT_INTERCONNECT_DAC0_OUT0_EN: DAC0_OUT0 enable
      \arg        EVENT_INTERCONNECT_DAC0_OUT1_EN: DAC0_OUT1 enable
      \arg        EVENT_INTERCONNECT_DMAMUX_0: DMAMUX multiplexer input 0
      \arg        EVENT_INTERCONNECT_DMAMUX_1: DMAMUX multiplexer input 1
      \arg        EVENT_INTERCONNECT_DMAMUX_2: DMAMUX multiplexer input 2
      \arg        EVENT_INTERCONNECT_DMAMUX_3: DMAMUX multiplexer input 3
      \arg        EVENT_INTERCONNECT_DMAMUX_4: DMAMUX multiplexer input 4
      \arg        EVENT_INTERCONNECT_DMAMUX_5: DMAMUX multiplexer input 5
      \arg        EVENT_INTERCONNECT_DMAMUX_6: DMAMUX multiplexer input 6
      \arg        EVENT_INTERCONNECT_DMAMUX_7: DMAMUX multiplexer input 7
      \arg        EVENT_INTERCONNECT_DMAMUX_8: DMAMUX multiplexer input 8
      \arg        EVENT_INTERCONNECT_DMAMUX_9: DMAMUX multiplexer input 9
      \arg        EVENT_INTERCONNECT_DMAMUX_10: DMAMUX multiplexer input 10
      \arg        EVENT_INTERCONNECT_DMAMUX_11: DMAMUX multiplexer input 11
    \param[out] none
    \retval     none
*/
void evic_register_lock_set(evic_periph_enum target_periph)
{

