burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_evic.c
    /*!< lock target peripheral register */
    EVIC_TARGET_REG(target_periph) |= EVIC_TARGET_LK;
}

/*!
    \brief      get the event interconnect register lock status (API_ID(0x0004U))
    \param[in]  target_periph: target peripheral value
                only one parameter can be selected which is shown as below:
      \arg        EVENT_INTERCONNECT_SGIO0: single I/O 0
      \arg        EVENT_INTERCONNECT_SGIO1: single I/O 1
      \arg        EVENT_INTERCONNECT_SGIO2: single I/O 2
      \arg        EVENT_INTERCONNECT_SGIO3: single I/O 3
      \arg        EVENT_INTERCONNECT_INGRPE: input group E
      \arg        EVENT_INTERCONNECT_INGRPF: input group F
      \arg        EVENT_INTERCONNECT_OUTGRPE: output group E
      \arg        EVENT_INTERCONNECT_OUTGRPF: output group F
      \arg        EVENT_INTERCONNECT_DAC0_OUT0_COV: DAC0_OUT0 conversion
      \arg        EVENT_INTERCONNECT_DAC0_OUT1_COV: DAC0_OUT1 conversion
      \arg        EVENT_INTERCONNECT_ADC0_GRP_EXTRIG0: ADC0 group external trigger 0
      \arg        EVENT_INTERCONNECT_ADC0_GRP_EXTRIG1: ADC0 group external trigger 1
      \arg        EVENT_INTERCONNECT_ADC2_GRP_EXTRIG0: ADC2 group external trigger 0
      \arg        EVENT_INTERCONNECT_ADC2_GRP_EXTRIG1: ADC2 group external trigger 1
      \arg        EVENT_INTERCONNECT_RCU: clock switch to IRC32M
      \arg        EVENT_INTERCONNECT_TIMER0: TIMER0
      \arg        EVENT_INTERCONNECT_TIMER7: TIMER7
      \arg        EVENT_INTERCONNECT_CPTIMER0: CPTIMER0
      \arg        EVENT_INTERCONNECT_CPTIMERW: CPTIMERW
      \arg        EVENT_INTERCONNECT_TIMER1: TIMER1
      \arg        EVENT_INTERCONNECT_TIMER2: TIMER2
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN0: GPTIMER trigger input 0
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN1: GPTIMER trigger input 1
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN2: GPTIMER trigger input 2
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN3: GPTIMER trigger input 3
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN4: GPTIMER trigger input 4
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN5: GPTIMER trigger input 5
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN6: GPTIMER trigger input 6
      \arg        EVENT_INTERCONNECT_GPTIMER_TRIGIN7: GPTIMER trigger input 7
      \arg        EVENT_INTERCONNECT_DAC0_OUT0_EN: DAC0_OUT0 enable
      \arg        EVENT_INTERCONNECT_DAC0_OUT1_EN: DAC0_OUT1 enable
      \arg        EVENT_INTERCONNECT_DMAMUX_0: DMAMUX multiplexer input 0
      \arg        EVENT_INTERCONNECT_DMAMUX_1: DMAMUX multiplexer input 1
      \arg        EVENT_INTERCONNECT_DMAMUX_2: DMAMUX multiplexer input 2
      \arg        EVENT_INTERCONNECT_DMAMUX_3: DMAMUX multiplexer input 3
      \arg        EVENT_INTERCONNECT_DMAMUX_4: DMAMUX multiplexer input 4
      \arg        EVENT_INTERCONNECT_DMAMUX_5: DMAMUX multiplexer input 5
      \arg        EVENT_INTERCONNECT_DMAMUX_6: DMAMUX multiplexer input 6
      \arg        EVENT_INTERCONNECT_DMAMUX_7: DMAMUX multiplexer input 7
      \arg        EVENT_INTERCONNECT_DMAMUX_8: DMAMUX multiplexer input 8
      \arg        EVENT_INTERCONNECT_DMAMUX_9: DMAMUX multiplexer input 9
      \arg        EVENT_INTERCONNECT_DMAMUX_10: DMAMUX multiplexer input 10
      \arg        EVENT_INTERCONNECT_DMAMUX_11: DMAMUX multiplexer input 11
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus evic_register_lock_get(evic_periph_enum target_periph)
{
    FlagStatus reval = RESET;

    if(RESET != (EVIC_TARGET_REG(target_periph) & EVIC_TARGET_LK)) {
        reval = SET;
    } else {
        reval = RESET;
    }

    return reval;
}

/*!
    \brief      select CPTIMERW or CPTIMER0 slave mode (API_ID(0x0005U))
    \param[in]  cptimer_periph: TARGET_CPTIMERW, TARGET_CPTIMER0
    \param[in]  slavemode: slave mode
                only one parameter can be selected which is shown as below:
      \arg        EVIC_COUNTER_ENABLE: counter is enabled
      \arg        EVIC_COUNTER_RESTART: counter is restarted
      \arg        EVIC_EVENT_COUNT: event count
      \arg        EVIC_EVENT_TRIGGER_DISABLE: event trigger is disabled
    \param[out] none
    \retval     none
*/
void evic_cptimer_slave_mode_select(evic_cptimer_enum cptimer_periph, uint32_t slavemode)
{
    /* select CPTIMERW slave mode */
    if(TARGET_CPTIMERW == cptimer_periph) {
        EVIC_SMCFG1 &= (~EVIC_SMCFG1_CPTIMERW_SMSEL);
        EVIC_SMCFG1 |= (slavemode & EVIC_SMCFG1_CPTIMERW_SMSEL);
        /* select CPTIMER0 slave mode */
    } else if(TARGET_CPTIMER0 == cptimer_periph) {
        EVIC_SMCFG0 &= (~EVIC_SMCFG0_CPTIMER0_SMSEL);
        EVIC_SMCFG0 |= (slavemode & EVIC_SMCFG0_CPTIMER0_SMSEL);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure evic group member (API_ID(0x0006U))
    \param[in]  group_pin: group I/O pin
                one or more parameters can be selected which are shown as below:
      \arg        EVIC_GRPIO_PIN_x(x=8..14)
    \param[in]  group_port
                only one parameter can be selected which is shown as below:
      \arg        EVIC_GRPIO_PORT_E: group I/O port E is selected
      \arg        EVIC_GRPIO_PORT_F: group I/O port F is selected
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void evic_group_member_config(uint32_t group_pin, uint32_t group_port, ControlStatus newvalue)
{
    if(newvalue == ENABLE) {
        /* configure group E member */
        if(EVIC_GRPIO_PORT_E == group_port) {
            EVIC_GRPECFG |= (group_pin & GROUP_PIN_MASK);
            /* configure group F member */
        } else if(EVIC_GRPIO_PORT_F == group_port) {
            EVIC_GRPFCFG |= (group_pin & GROUP_PIN_MASK);
        } else {
            /* illegal parameters */
        }
    } else {
        /* configure group E member */
        if(EVIC_GRPIO_PORT_E == group_port) {
            EVIC_GRPECFG &= (~(group_pin & GROUP_PIN_MASK));
            /* configure group F member */
        } else if(EVIC_GRPIO_PORT_F == group_port) {
            EVIC_GRPFCFG &= (~(group_pin & GROUP_PIN_MASK));
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure evic group input detection edge (API_ID(0x0007U))
    \param[in]  group_edge: group I/O input detection edge
                only one parameter can be selected which is shown as below:
      \arg        EVIC_GRPIO_DETECTION_RISING: Generate event when group I/O input rising edge
      \arg        EVIC_GRPIO_DETECTION_FALLING: Generate event when group I/O input falling edge
      \arg        EVIC_GRPIO_DETECTION_BOTH_EDGE: Generate event when group I/O input both edges
    \param[in]  group_port
                only one parameter can be selected which is shown as below:
      \arg        EVIC_GRPIO_PORT_E: group I/O port E is selected
      \arg        EVIC_GRPIO_PORT_F: group I/O port F is selected
    \param[out] none
    \retval     none
*/
void evic_group_edge_detection_config(uint32_t group_edge, uint32_t group_port)
{
    /* configure group E input detection edge */
    if(EVIC_GRPIO_PORT_E == group_port) {
        EVIC_GRPECFG &= (~EVIC_GRPECFG_GRPEIND);
        EVIC_GRPECFG |= (group_edge & EVIC_GRPECFG_GRPEIND);
        /* configure group F input detection edge */
    } else if(EVIC_GRPIO_PORT_F == group_port) {
        EVIC_GRPFCFG &= (~EVIC_GRPFCFG_GRPFIND);
        EVIC_GRPFCFG |= (group_edge & EVIC_GRPFCFG_GRPFIND);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure evic group output level (API_ID(0x0008U))
    \param[in]  group_level: group I/O output level
                only one parameter can be selected which is shown as below:
      \arg        EVIC_GRPIO_OUTPUT_LOW: group I/O output low level when event comes
      \arg        EVIC_GRPIO_OUTPUT_HIGH: group I/O output high level when event comes
      \arg        EVIC_GRPIO_OUTPUT_INVERTED: group I/O output inverted level when event comes
      \arg        EVIC_GRPIO_OUTPUT_DATA: group I/O output holding data when event comes
      \arg        EVIC_GRPIO_OUTPUT_CIRCULAR_DATA: group I/O circularly shift output holding data when event comes
    \param[in]  group_port
                only one parameter can be selected which is shown as below:
      \arg        EVIC_GRPIO_PORT_E: group I/O port E is selected
      \arg        EVIC_GRPIO_PORT_F: group I/O port F is selected
    \param[out] none
    \retval     none
*/
void evic_group_output_level_config(uint32_t group_level, uint32_t group_port)
{
    /* configure group E output level */
    if(EVIC_GRPIO_PORT_E == group_port) {
        EVIC_GRPECFG &= (~EVIC_GRPECFG_GRPEOSEL);
        EVIC_GRPECFG |= (group_level & EVIC_GRPECFG_GRPEOSEL);
        /* configure group F output level */
    } else if(EVIC_GRPIO_PORT_F == group_port) {
        EVIC_GRPFCFG &= (~EVIC_GRPFCFG_GRPFOSEL);
        EVIC_GRPFCFG |= (group_level & EVIC_GRPFCFG_GRPFOSEL);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      enable evic group overwrite function (API_ID(0x0009U))
    \param[in]  group_port
                only one parameter can be selected which is shown as below:
      \arg        EVIC_GRPIO_PORT_E: group I/O port E is selected
      \arg        EVIC_GRPIO_PORT_F: group I/O port F is selected
    \param[out] none
    \retval     none
*/
void evic_group_overwrite_enable(uint32_t group_port)
{
    /* enable group E overwrite function */
    if(EVIC_GRPIO_PORT_E == group_port) {
        EVIC_GRPECFG |= EVIC_GRPECFG_OVWEN;
        /* enable group F overwrite function */
    } else if(EVIC_GRPIO_PORT_F == group_port) {
        EVIC_GRPFCFG |= EVIC_GRPFCFG_OVWEN;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      disable evic group overwrite function (API_ID(0x000AU))
    \param[in]  group_port
                only one parameter can be selected which is shown as below:
      \arg        EVIC_GRPIO_PORT_E: group I/O port E is selected
      \arg        EVIC_GRPIO_PORT_F: group I/O port F is selected
    \param[out] none
    \retval     none
*/
void evic_group_overwrite_disable(uint32_t group_port)
{
    /* disable group E overwrite function */
    if(EVIC_GRPIO_PORT_E == group_port) {
        EVIC_GRPECFG &= (~EVIC_GRPECFG_OVWEN);
        /* disable group F overwrite function */
    } else if(EVIC_GRPIO_PORT_F == group_port) {
        EVIC_GRPFCFG &= (~EVIC_GRPFCFG_OVWEN);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      set group holding data value (API_ID(0x000BU))
    \param[in]  data: data to be loaded(0~127)
    \param[in]  group_port
                only one parameter can be selected which is shown as below:
      \arg        EVIC_GRPIO_PORT_E: group I/O port E is selected
      \arg        EVIC_GRPIO_PORT_F: group I/O port F is selected
    \param[out] none
    \retval     none
*/
void evic_data_set(uint8_t data, uint32_t group_port)
{
    /* set group E holding data */
    if(EVIC_GRPIO_PORT_E == group_port) {
        EVIC_GRPEDH = data;
        /* set group F holding data */
    } else if(EVIC_GRPIO_PORT_F == group_port) {
        EVIC_GRPFDH = data;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      get group holding data value (API_ID(0x000CU))
    \param[in]  group_port
                only one parameter can be selected which is shown as below:
      \arg        EVIC_GRPIO_PORT_E: group I/O port E is selected
      \arg        EVIC_GRPIO_PORT_F: group I/O port F is selected
    \param[out] none
    \retval     group holding data: 0~127
*/
uint8_t evic_data_get(uint32_t group_port)
{
    uint8_t data = 0U;

