burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_evic.c
    /* get group E holding data */
    if(EVIC_GRPIO_PORT_E == group_port) {
        data = (uint8_t)EVIC_GRPEDH;
        /* get group F holding data */
    } else if(EVIC_GRPIO_PORT_F == group_port) {
        data = (uint8_t)EVIC_GRPFDH;
    } else {
        /* illegal parameters */
    }
    return data;
}

/*!
    \brief      configure evic single I/O (API_ID(0x000DU))
    \param[in]  single_pin: single I/O pin
                only one parameter can be selected which is shown as below:
      \arg        EVIC_SGIO_PIN_x(x=8..14)
    \param[in]  single_port: single I/O port
                only one parameter can be selected which is shown as below:
      \arg        EVIC_SGIO_PORT_E: single I/O port E is selected
      \arg        EVIC_SGIO_PORT_F: single I/O port F is selected
    \param[in]  single_io: single I/O instance
                only one parameter can be selected which is shown as below:
      \arg        SGIOx (x=0..3)
    \param[out] none
    \retval     none
*/
void evic_single_io_config(uint32_t single_pin, uint32_t single_port, evic_single_io_enum single_io)
{
    switch(single_io) {
    case SGIO0:
        EVIC_SGIOCFG0 &= ~(EVIC_SGIOCFGX_SGIOPORT | EVIC_SGIOCFGX_SGIOPIN);
        EVIC_SGIOCFG0 |= ((single_port & EVIC_SGIOCFGX_SGIOPORT) | (single_pin & EVIC_SGIOCFGX_SGIOPIN));
        break;
    case SGIO1:
        EVIC_SGIOCFG1 &= ~(EVIC_SGIOCFGX_SGIOPORT | EVIC_SGIOCFGX_SGIOPIN);
        EVIC_SGIOCFG1 |= ((single_port & EVIC_SGIOCFGX_SGIOPORT) | (single_pin & EVIC_SGIOCFGX_SGIOPIN));
        break;
    case SGIO2:
        EVIC_SGIOCFG2 &= ~(EVIC_SGIOCFGX_SGIOPORT | EVIC_SGIOCFGX_SGIOPIN);
        EVIC_SGIOCFG2 |= ((single_port & EVIC_SGIOCFGX_SGIOPORT) | (single_pin & EVIC_SGIOCFGX_SGIOPIN));
        break;
    case SGIO3:
        EVIC_SGIOCFG3 &= ~(EVIC_SGIOCFGX_SGIOPORT | EVIC_SGIOCFGX_SGIOPIN);
        EVIC_SGIOCFG3 |= ((single_port & EVIC_SGIOCFGX_SGIOPORT) | (single_pin & EVIC_SGIOCFGX_SGIOPIN));
        break;
    default:
        break;
    }
}

/*!
    \brief      configure evic single I/O input detection edge (API_ID(0x000EU))
    \param[in]  single_edge: single I/O input detection edge
                only one parameter can be selected which is shown as below:
      \arg        EVIC_SGIO_DETECTION_RISING: Generate event when single I/O input rising edge
      \arg        EVIC_SGIO_DETECTION_FALLING: Generate event when single I/O input falling edge
      \arg        EVIC_SGIO_DETECTION_BOTH_EDGE: Generate event when single I/O input both edges
    \param[in]  single_io: single I/O instance
                only one parameter can be selected which is shown as below:
      \arg        SGIOx (x=0..3)
    \param[out] none
    \retval     none
*/
void evic_single_io_edge_detection_config(uint32_t single_edge, evic_single_io_enum single_io)
{
    switch(single_io) {
    case SGIO0:
        EVIC_SGIOCFG0 &= (~EVIC_SGIOCFGX_SGIOM);
        EVIC_SGIOCFG0 |= (single_edge & EVIC_SGIOCFGX_SGIOM);
        break;
    case SGIO1:
        EVIC_SGIOCFG1 &= (~EVIC_SGIOCFGX_SGIOM);
        EVIC_SGIOCFG1 |= (single_edge & EVIC_SGIOCFGX_SGIOM);
        break;
    case SGIO2:
        EVIC_SGIOCFG2 &= (~EVIC_SGIOCFGX_SGIOM);
        EVIC_SGIOCFG2 |= (single_edge & EVIC_SGIOCFGX_SGIOM);
        break;
    case SGIO3:
        EVIC_SGIOCFG3 &= (~EVIC_SGIOCFGX_SGIOM);
        EVIC_SGIOCFG3 |= (single_edge & EVIC_SGIOCFGX_SGIOM);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure evic single I/O input detection edge (API_ID(0x000FU))
    \param[in]  single_level: single I/O output level
                only one parameter can be selected which is shown as below:
      \arg        EVIC_SGIO_OUTPUT_LOW: single I/O output low level when event comes
      \arg        EVIC_SGIO_OUTPUT_HIGH: single I/O output high level when event comes
      \arg        EVIC_SGIO_OUTPUT_INVERTED: single I/O output inverted level when event comes
    \param[in]  single_io: single I/O instance
                only one parameter can be selected which is shown as below:
      \arg        SGIOx (x=0..3)
    \param[out] none
    \retval     none
*/
void evic_single_io_output_level_config(uint32_t single_level, evic_single_io_enum single_io)
{
    switch(single_io) {
    case SGIO0:
        EVIC_SGIOCFG0 &= (~EVIC_SGIOCFGX_SGIOM);
        EVIC_SGIOCFG0 |= (single_level & EVIC_SGIOCFGX_SGIOM);
        break;
    case SGIO1:
        EVIC_SGIOCFG1 &= (~EVIC_SGIOCFGX_SGIOM);
        EVIC_SGIOCFG1 |= (single_level & EVIC_SGIOCFGX_SGIOM);
        break;
    case SGIO2:
        EVIC_SGIOCFG2 &= (~EVIC_SGIOCFGX_SGIOM);
        EVIC_SGIOCFG2 |= (single_level & EVIC_SGIOCFGX_SGIOM);
        break;
    case SGIO3:
        EVIC_SGIOCFG3 &= (~EVIC_SGIOCFGX_SGIOM);
        EVIC_SGIOCFG3 |= (single_level & EVIC_SGIOCFGX_SGIOM);
        break;
    default:
        break;
    }
}

/*!
    \brief      enable software event register write
    \param[in]  none
    \param[out] none
    \retval     none
*/
void evic_register_write_enable(void)
{
    EVIC_SWEV |= EVIC_SWTR_RWEN;
}

/*!
    \brief      disable software event register write
    \param[in]  none
    \param[out] none
    \retval     none
*/
void evic_register_write_disable(void)
{
    EVIC_SWEV &= (~EVIC_SWTR_RWEN);
}

/*!
    \brief      get software event register write enable status
    \param[in]  none
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus evic_register_write_enable_get(void)
{
    FlagStatus reval = RESET;

    if(RESET != (EVIC_SWEV & EVIC_SWTR_RWEN)) {
        reval = SET;
    } else {
        reval = RESET;
    }

    return reval;
}

/*!
    \brief      enable software event generation bit write
    \param[in]  none
    \param[out] none
    \retval     none
*/
void evic_bit_write_enable(void)
{
    if(RESET != evic_register_write_enable_get()) {
        EVIC_SWEV |= EVIC_SWTR_BWEN;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      disable software event generation bit write
    \param[in]  none
    \param[out] none
    \retval     none
*/
void evic_bit_write_disable(void)
{
    if(RESET != evic_register_write_enable_get()) {
        EVIC_SWEV &= (~EVIC_SWTR_BWEN);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      get software event generation bit write enable status
    \param[in]  none
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus evic_bit_write_enable_get(void)
{
    FlagStatus reval = RESET;

    if(RESET != (EVIC_SWEV & EVIC_SWTR_BWEN)) {
        reval = SET;
    } else {
        reval = RESET;
    }

    return reval;
}

/*!
    \brief      evic software event generation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void evic_software_event_generation(void)
{
    FlagStatus status0 = RESET;
    FlagStatus status1 = RESET;

    status0 = evic_register_write_enable_get();
    status1 = evic_bit_write_enable_get();

    if((RESET != status0) && (RESET != status1)) {
        EVIC_SWEV |= EVIC_SWTR_SWEVG;
    } else {
        /* illegal parameters */
    }
}
